<template>
  <div class="container">
    <div class="wrapper">
      <h4>css3练习</h4>
      <p>
        因为守护着高速“疫”站，思念的话没时间说;淡淡萦绕的高速乡愁，与我们共同坚守，约好春暖花开，我们一起回家!——题记
        有人说，疫情当前，众生相尽显。幸运的是，我们极目望去，所看到的都是温暖的瞬间。
        是的，今年的春节和记忆中的春节是不一样的。因为一场“疫情”的搅局，令我们不能走亲访友，不能正常拜年，就连正常的出门也不允许。而我们高速人，在人民最需要的时候，我们毅然决然吹响了号角，同赴抗“疫”前线，坚守“疫”站、抗击“疫”毒。
        在那日返回单位的路上，我看着窗外寥寥无几的车辆，越临近单位越觉得肩上的责任重大。耳畔依稀还有老妈的临行前的叮嘱，在逆行者前行的路上，危机四伏，你要保护好自己呀。此时的我，肩上除了责任，还挂满了亲人嘱咐和担心，所以我的脚步不会迟疑，也从未停滞。
        一个口罩、一双手套、一个喇叭、一个指挥棒，我们穿插于收费广场留下太多足迹;一张桌子、一个体温检测仪、一瓶酒精、一个职守日志，我们在进入院区必经之路上筑起了第一道防线堡垒;戴上口罩、穿上手套、着反光服、胸前挂党徽、身后背消毒喷洒壶的那个人，却是我们“疫”站里一道最温暖的流动风景。
        每天清晨醒来，我会习惯性的打开手机，虽然它带给我的消息都不尽人意，可是并没改变我一直坚信我们的国家总有一天会终结这场战“疫”。我听着、看着网络的疫情新闻，各地各项数据都在有增无减。但是我们并没有恐惧，我们也没有退缩。大家像亲人一样，互相提醒戴口罩、勤洗手、多穿衣、不外跑……。我们相互温暖着、关爱着，在这个远离城市喧嚣的高速公路上，竟然令我们有了“家”一样的温暖。
        转眼已是正月十五，晚饭前，儿子忽然发来视频，他说爸，你不想家吗，我说，想，但这个时候我不能离开。这时候，爱人凑了上来，拿走了手机。说了一句，别打扰你爸工作，留下一句“家里挺好，勿念。”便挂了。寥寥数字，轻描淡写，却让我读懂了爱人的心思。
        在抗击新型病毒的“疫”站里，这些日子过的倒也比较充实。我们的生活好像有了规律、也有了紧迫感。我们学会了从容应对，学会了互相关怀;学会了“慢性子”、戒掉了“躁脾气”。虽然大家口中常常念叨非常想家，可是任务一出来，大家都将“想家的事情”抛之九霄云外了。一晚，在微信群里，大家在讨论“我们什么时候能回家?”这时候，屏幕里出现了“等雾散了，太阳出来了;等花开了，春天到来了，我们就可以回家了”
      </p>
    </div>
  </div>
</template>

<script>
export default {};
</script>

<style lang="less" scoped>
.wrapper {
    margin: 30px;
    width: 100%;
    box-sizing: border-box;
    // 设置多列布局
    // 1.设置列数
    column-count: 3;
    // 2.添加列间隙的样式
    column-rule: dashed 3px red;
    // 3.设置列间隙大小
    column-gap: 50px;
    // 4. 设置列宽
    // 原则:取大优先
    // 1.如果人为设置宽度更大, 则取更大的值, 但是会填充整个屏幕, 意味着最终的宽度会大于设置的宽度--填充满整个屏幕
    // 2. 如果人为设置宽度更小, 则使用默认计算的宽度
    column-width: 450px;
}
h4 {
    column-span: all;
}
</style>